app/controllers/records_controller.rb

  def head_to_head
    @margin_victory = Detail.all(:select => "name, opponent, year, week, points,
                                                opponent_points, ABS(points-opponent_points) as difference",
                                    :order => "year, difference")

    @margins = Detail.all(:select => "year, MAX(ABS(points-opponent_points)) as max_margin, MIN(ABS(points-opponent_points)) as min_margin", :group => "year", :order => "year")
    @max_margin = Detail.all(:select => "*, ABS(points-opponent_points) as difference", :order => "year",
                            :conditions => "points-opponent_points IN (#{@margins.collect(&:max_margin).join(", ")})")
    @min_margin = Detail.all(:select => "*, ABS(points-opponent_points) as difference", :order => "year",
                            :conditions => "points-opponent_points IN (#{@margins.collect(&:min_margin).join(", ")})")

    @strengths = Detail.all(:select => "name, opponent, year, week, avg(points) as avg_points,
                                                avg(opponent_points) as avg_opponent_points",
                                    :group => "name, year", :order => "year, avg_opponent_points")

    @all_strengths = Detail.all(:select => "name, opponent, year, week, avg(points) as avg_points,
                                            avg(opponent_points) as avg_opponent_points",
                                :conditions => "year >= '2007'",
                                :group => "name", :order => "avg_opponent_points")
    @strength_years = @strengths.collect(&:year).uniq
    @max_strength = []
    @min_strength = []
    @strength_years.each do |year|
      @max_strength << @strengths.collect{|u|u.avg_opponent_points if u.year == year}.compact.max
      @min_strength << @strengths.collect{|u|u.avg_opponent_points if u.year == year}.compact.min
    end

    @ranks = Summary.all(:select => "name, year, rank, reg_season_rank")
---
SELECT *, ABS(points-opponent_points) as difference FROM `details` WHERE (points-opponent_points IN (115.71, 85.86, 83.59, 118.92, 116.23, 98.73)) ORDER BY year
SELECT name, year, rank, reg_season_rank FROM `summaries`

  def historical
    @names = Summary.all(:conditions => "year = '2009'").collect(&:name).uniq
---
SELECT year, avg(win_percentage) as win_percent, avg(points) as points FROM `summaries` WHERE (year > 2003) GROUP BY year

  def team_statistics
    @all_time = Summary.all(:select => "avg(rank) as rank, avg(reg_season_rank) as reg_rank, name, sum(wins) as wins,
                                        sum(losses) as losses, (sum(wins))/(sum(wins)+sum(losses))*100 as win_percent,
                                        sum(points) as points, sum(points)/count(champion) as points_per_year, count(champion) as years_played,
                                        sum(champion) as championships, avg(draft_position) as draft_position",
                             :group => "name", :order => "rank, reg_rank", :conditions => "year > 2003")
---
SELECT year, avg(win_percentage) as win_percent, avg(points) as points FROM `summaries` WHERE (year > 2003) GROUP BY year